Documents/ПеремещениеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПеремещениеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДСПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередачаПрибыли</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Enums/ВидыПодразделений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>ВидыПодразделений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Производство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Логистик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеДенежныхСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РазличныеПодразделения = Подразделение <> ПодразделениеПолучатель;
	
	Если РазличныеПодразделения Тогда
		Если ПередачаПрибыли Тогда
			СформироватьДвижениеПередачаПрибыли();
		Иначе
			СформироватьДвижениеДенегВРазныхПодразделенях();
		КонецЕсли;
	Иначе
		СформироватьДвижениеДенегВОдномПодразделении();
	КонецЕсли;
	
	Движения.Управленческий.Записывать = Истина;
	
КонецПроцедуры

Функция СформироватьДвижениеДенегВОдномПодразделении()
	
	Проводки = СоздатьПроводку(Подразделение);
	
	Проводки.СчетКт = ПланыСчетов.Управленческий.РасчетныйСчет;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет] = Счет;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = СтатьяДДС;
	
	Проводки.СчетДт = ПланыСчетов.Управленческий.РасчетныйСчет;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет] = СчетПолучателя;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = СтатьяДДСПолучателя;
	
КонецФункции

Функция СформироватьДвижениеДенегВРазныхПодразделенях();
	
	Проводки = СоздатьПроводку(Подразделение);
	
	Проводки.СчетКт = ПланыСчетов.Управленческий.РасчетныйСчет;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет] = Счет;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = СтатьяДДС;
	
	Проводки.СчетДт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = ПодразделениеПолучатель;
	
	Проводки = СоздатьПроводку(ПодразделениеПолучатель);
	
	Проводки.СчетДт = ПланыСчетов.Управленческий.РасчетныйСчет;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет] = СчетПолучателя;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = СтатьяДДСПолучателя;
	
	Проводки.СчетКт = ПланыСчетов.Управленческий.ВзаиморасчетыСПодразделениями;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Подразделения] = Подразделение;
	
КонецФункции

Функция СформироватьДвижениеПередачаПрибыли();
	
	Проводки = СоздатьПроводку(Подразделение);
	
	Проводки.СчетКт = ПланыСчетов.Управленческий.РасчетныйСчет;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет] = Счет;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = СтатьяДДС;
	
	Проводки.СчетДт = ЛексСервер.ПолучитьЗатратныйСчетПодразделения(Подразделение);
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] = Справочники.СтатьиДоходовРасходов.ПередачаВыручкиНаУправление;
	
	Проводки = СоздатьПроводку(ПодразделениеПолучатель);
	
	Проводки.СчетДт = ПланыСчетов.Управленческий.РасчетныйСчет;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.РасчетныйСчет] = СчетПолучателя;
	Проводки.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДДС] = СтатьяДДСПолучателя;
	
	Проводки.СчетКт = ПланыСчетов.Управленческий.Доходы;
	Проводки.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.СтатьиДР] =ЛексСервер.ПолучитьСтатьюДоходаУправления(Подразделение) ;
	
КонецФункции

Функция СоздатьПроводку(фПодразделение)
		
	Проводки = Движения.Управленческий.Добавить();
	Проводки.Подразделение = фПодразделение;
	Проводки.Период = Дата;
	Проводки.Сумма = Сумма;
	
	Возврат Проводки;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПередачаПрибыли = ПередачаПрибыли И ПодразделениеПолучатель.ВидПодразделения = Перечисления.ВидыПодразделений.Управление;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//Если Подразделение <> ПодразделениеПолучатель Тогда
	//	
	//	Если СтатьяДДСОтправитель.СтатьяДоходовРасходов.ВидСтатьи <> Перечисления.ВидСтатьи.Расход Тогда
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Статья ДДС отправителя должна быть расходной";
	//		Сообщение.Поле = "СтатьяДДСОтправитель";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		
	//		Отказ = Истина;
	//		
	//	КонецЕсли;
	//	
	//	Если СтатьяДДСПолучатель.СтатьяДоходовРасходов.ВидСтатьи <> Перечисления.ВидСтатьи.Доход Тогда
	//		
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Статья ДДС получателя должна быть расходной";
	//		Сообщение.Поле = "СтатьяДДСПолучатель";
	//		Сообщение.УстановитьДанные(ЭтотОбъект);
	//		Сообщение.Сообщить();
	//		
	//		Отказ = Истина;
	//		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры
